In [1]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame

In [2]:
data=Series(['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [3]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [8]:
dframe=DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [9]:
clean_frame=dframe.dropna()
clean_frame

     0    1    2
0  1.0  2.0  3.0

In [10]:
dframe.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [11]:
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [22]:
npn = np.nan

dfram2 = DataFrame([[1,2,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dfram2

     0    1    2    3
0  1.0  2.0  NaN  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [16]:
dfram2.dropna(thresh=3)

     0   1    2    3
1  2.0 NaN  5.0  6.0

In [23]:
dfram2.fillna(0)

     0    1    2    3
0  1.0  2.0  0.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [ ]:
dfram2.fillna(({0:0,1:1,2:2,3:3 })

In [28]:
dfram2.fillna(0,inplace=True)

In [29]:
dfram2

     0    1    2    3
0  1.0  2.0  0.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0